---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint.NextCurveType
source: html/74945c50-caf1-14cc-4223-bfe4f6c8e9b8.htm
---
# Autodesk.Revit.DB.Infrastructure.HorizontalCurveEndpoint.NextCurveType Property

The HorizontalCurveType
 of the curve which connects the endpoint to the next displayed curve.
 If this endpoint's Station equals
 DisplayedEndStation , returns Unknown curve type.

## Syntax (C#)
```csharp
public HorizontalCurveType NextCurveType { get; internal set; }
```